# ===========================================
# 配下の各フォルダにファイル配布(not再帰)
# ===========================================
# -------------------------------------------
# 定数
# -------------------------------------------
$TARGET_DIR = "C:\_git\__worktmp\"

# -------------------------------------------
# 関数
# -------------------------------------------
# 共通部品(エラー出るときはps実行フォルダを確かめる？)
. .\common\module.ps1

# コピーファイルパス
[string]$srcFilepath = (Read-Host コピーしたいファイルパス)
function main {
    # フォルダ一覧取得 再帰なし
    $dirList = Get-ChildItem -Path $TARGET_DIR -Directory

    $dirList | ForEach-Object {
        # ファイルコピー
        $_.FullName
        Copy-Item -Path $srcFilepath $_.FullName
        Write-ErrorLog
    }
}

# -------------------------------------------
# 実行
# -------------------------------------------
main