# ===========================================
# フォルダ名のカテゴリ削除
# _カテゴリ_カテゴリ_元のフォルダ名
# ===========================================
# -------------------------------------------
# 定数
# -------------------------------------------
$TARGET_DIR = "C:\_git\__worktmp\"

# -------------------------------------------
# 関数
# -------------------------------------------
# 共通部品(エラー出るときはps実行フォルダを確かめる？)
. .\common\module.ps1

function main {
    # 削除カテゴリ数
    [int]$categoryCnt = (Read-Host 削除カテゴリ数)

    # フォルダ一覧取得 再帰なし
    $dirList = Get-ChildItem -Path $TARGET_DIR -Directory

    $dirList | ForEach-Object {
        # 指定回数分 _カテゴリ を取得する正規表現
        $reg = [regex]("([^_]+_){" + $categoryCnt + "}")
        # カテゴリ削除
        $newnm = $reg.Replace($_.Name, "", 1)
        # フォルダ名変更
        Rename-Item -Path $_.FullName -NewName $newnm
        ErrorLog
    }
}

# -------------------------------------------
# 実行
# -------------------------------------------
main